# pandas

In [1]:
import pandas as pd

In [2]:
print(pd.__version__)

1.4.4

In [3]:
A = pd.Series([1.5,2.5,3,5], index=('a','b','c','d'))

In [4]:
A

a    1.5
b    2.5
c    3.0
d    5.0
dtype: float64

In [5]:
B = pd.DataFrame({"Yes": [44, 22], "No": [12, 15], "Compare":[2, 23]})

In [6]:
B

   Yes  No  Compare
0   44  12        2
1   22  15       23

In [7]:
A[2]

3.0

In [8]:
grads_dict = {'A': 4.0, 'B': 3.0, 'C': 2.50, 'D':2.00}

In [9]:
grads = pd.Series(grads_dict)

In [10]:
grads

A    4.0
B    3.0
C    2.5
D    2.0
dtype: float64

In [11]:
grads.values

array([4. , 3. , 2.5, 2. ])

In [12]:
marks_dict = {'A': 85, 'B': 75, 'C': 65, 'D': 55} 
marks =  pd.Series(marks_dict)

In [13]:
marks

A    85
B    75
C    65
D    55
dtype: int64

In [14]:
marks['A']

85

In [ ]:
marks[2:0]

In [ ]:
marks

In [17]:
D = pd.DataFrame({'Marks': marks, "Grades":grads})

In [18]:
D

   Marks  Grades
A     85     4.0
B     75     3.0
C     65     2.5
D     55     2.0

In [19]:
D.T

           A     B     C     D
Marks   85.0  75.0  65.0  55.0
Grades   4.0   3.0   2.5   2.0

In [20]:
D.values

array([[85. ,  4. ],
       [75. ,  3. ],
       [65. ,  2.5],
       [55. ,  2. ]])

In [21]:
D.values[2,1]

2.5

In [22]:
D.values[3,0]

55.0

In [23]:
D.values[3,1]

2.0

In [24]:
D['ScaledMarks'] = 100*(D['Marks']/90)

In [25]:
D

   Marks  Grades  ScaledMarks
A     85     4.0    94.444444
B     75     3.0    83.333333
C     65     2.5    72.222222
D     55     2.0    61.111111

In [26]:
del D['ScaledMarks']

In [27]:
D

   Marks  Grades
A     85     4.0
B     75     3.0
C     65     2.5
D     55     2.0

In [28]:
G = D[D['Marks']> 70]

In [29]:
G

   Marks  Grades
A     85     4.0
B     75     3.0

In [30]:
G = D[D['Grades'] > 3.50]

In [31]:
G

   Marks  Grades
A     85     4.0

In [32]:
A = pd.DataFrame([{'a':5, 'b': 4.5}, {'b':6.0, 'c':-3}])

In [33]:
A

     a    b    c
0  5.0  4.5  NaN
1  NaN  6.0 -3.0

In [34]:
A.fillna(0)

     a    b    c
0  5.0  4.5  0.0
1  0.0  6.0 -3.0

In [35]:
A = pd.Series(['a','b','c'], index=[1,2,3])

In [36]:
A[1]

'a'

In [37]:
A

1    a
2    b
3    c
dtype: object

In [38]:
A[1:3]

2    b
3    c
dtype: object

In [39]:
A.loc[1:3]

1    a
2    b
3    c
dtype: object

In [40]:
A.iloc[1:3]

2    b
3    c
dtype: object

In [ ]:
 D

In [ ]:
D.iloc[2,:]

In [ ]:
D.loc[::-1,:]

In [44]:
import pandas as pd 
import numpy as np
import sklearn

In [45]:
2&1

0

In [ ]:
x = input("Enter Y value")
y = input("Enter X value ")
if x < y:
    print("biggest number is y")
else:
    print("Biggest number x")